import { QuestionConfig } from './types';

const pythonQuestions: QuestionConfig[] = [
  {
    id: 'whileLoop',
    text: 'Студент спрашивает: есть while, а есть while True — в чём разница? Как вообще в этом разобраться? Что такое break и continue? Почему у меня завис код при запуске?',
  },
  {
    id: 'forLoop',
    text: 'Студент спрашивает: как работает цикл for? С какими данными? for i in range() — что такое i и range? Почему, если написать вместо i что-то другое, тоже будет работать? Я пытаюсь в цикле for поменять элементы списка/кортежа, но у меня ничего не изменяется — почему?',
  },
  {
    id: 'dictionary',
    text: 'Студент спрашивает: я пытаюсь в качестве ключа словаря сделать список, но программа ругается... Как мне сразу обратиться и к ключу, и к значению? Предположим, что у меня есть данные по студентам и их оценкам за тест, и я хочу в качестве ключей сделать оценки, но часть данных теряется — как это исправить? Как отсортировать словарь по значениям? А если в словаре ключ — это имя студента, а значение — список с оценками за три теста: как мне вывести фамилии студентов в зависимости от их оценки за первый тест (от большей к меньшей)?',
  },
];

export default pythonQuestions;
